<?xml version="1.0" encoding="utf-8"?>
<search>
  <entry>
    <title>个人博客搭建记录</title>
    <url>/posts/96e0/</url>
    <content><![CDATA[<p>之前都是在知乎上写博客，这样看的人也多，方便讨论，但是知乎的 markdown
编辑器不是很好用，本地写完后还需要一张一张上传图片，太麻烦了，就自己搭一个博客，又不想进行域名备案啥的，服务器也要出钱
:( 。最后搜到 Github 有提供免费的静态页面部署功能，这样写完 markdown
笔记可以直接上传到
Github，还可以通过网页访问，nice！(白嫖的感觉真好)</p>
<h1 id="github-pages">Github Pages</h1>
<h2 id="创建主页仓库">创建主页仓库</h2>
<p>通过 <a href="https://pages.github.com/">Github Pages</a>，我们可以将
markdown
撰写的笔记转换成静态网页，并进行部署。其创建流程也十分简单，只需要创建一个名为
<code>&lt;username&gt;.github.io</code> 的仓库，如下图所示</p>
<p><img data-src="/posts/96e0/image-20230102151015131.png"
style="zoom:50%;" /></p>
<p>此处我们选择的是 Private
仓库，只有我们能进行修改，但是主页是公开访问的，这样可以保证笔记源文件安全
:) 。</p>
<span id="more"></span>

<p>创建完成后仓库中什么都没有</p>
<p><img data-src="/posts/96e0/image-20230102151942075.png"
style="zoom:33%;" /></p>
<p>此时我们在浏览器中输入 <a
href="https://purewhitevk.github.io"><span>https://purewhitevk.github.io</span></a>
（URL不区分大小写，直接用小写即可），显示404，页面不存在。</p>
<p><img data-src="/posts/96e0/image-20230102152125799.png"
style="zoom: 50%;" /></p>
<p>别心急，很快就可以看到博客页面了。</p>
<h2 id="静态博客框架">静态博客框架</h2>
<p>在网上搜了一下，有很多博客框架，例如 wordpress 等，但是 wordpress
需要数据库，还需要单独配服务器进行部署，太麻烦了，满足我们需求的有三个</p>
<ul>
<li><p>Jekyll（Github 原生支持）</p>
<p>使用 Ruby 实现</p></li>
<li><p>Hexo</p>
<p>使用 Node.js 实现</p></li>
<li><p>Hugo</p>
<p>使用 Go 实现</p></li>
</ul>
<p>三者在功能上大同小异，都可以直接将 <code>.md</code>
文件转换成<code>html</code> 文件，且支持部署在 Github Pages
上。个人比较推荐 <a

<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line"><span class="comment"># gcc 调用命令</span></span><br><span class="line">g++ -fdump-lang-class=- test.cpp</span><br><span class="line"><span class="comment"># clang 查看命令 （-Xclang 表示传递后面的参数给 clang compiler） </span></span><br><span class="line">clang++-15 -Xclang -fdump-record-layouts test.cpp</span><br><span class="line">clang++-15 -Xclang -fdump-vtable-layouts test.cpp</span><br><span class="line"><span class="comment"># msvc 查看命令</span></span><br><span class="line">cl /d1 reportAllClassLayout test.cpp</span><br></pre></td></tr></table></figure>

<p>我们可以使用一个简单的类测试</p>
<figure class="highlight c++"><table><tr><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="type">int</span> n&#123;<span class="number">0xfffd</span>&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">    A a;</span><br><span class="line">    a.<span class="built_in">func</span>();</span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<p>x86-64 gcc 9.4 输出结果</p>
<figure class="highlight txt"><table><tr><td class="code"><pre><span class="line">➜  src g++ -fdump-lang-class=- test.cpp</span><br><span class="line">Vtable for A</span><br><span class="line">A::_ZTV1A: 3 entries</span><br><span class="line">0     (int (*)(...))0</span><br><span class="line">8     (int (*)(...))(&amp; _ZTI1A)</span><br><span class="line">16    (int (*)(...))A::func</span><br><span class="line"></span><br><span class="line">Class A</span><br><span class="line">   size=16 align=8</span><br><span class="line">   base size=12 base align=8</span><br><span class="line">A (0x0x7ff174281420) 0</span><br><span class="line">    vptr=((&amp; A::_ZTV1A) + 16)</span><br></pre></td></tr></table></figure>

<p>x86-64 clang 15.0.7 输出结果</p>
<figure class="highlight txt"><table><tr><td class="code"><pre><span class="line">➜  src clang++-15 -Xclang -fdump-record-layouts test.cpp</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class A</span><br><span class="line">         0 |   (A vtable pointer)</span><br><span class="line">         8 |   int n</span><br><span class="line">           | [sizeof=16, dsize=12, align=8,</span><br><span class="line">           |  nvsize=12, nvalign=8]</span><br><span class="line">             </span><br><span class="line">*** Dumping IRgen Record Layout    </span><br><span class="line">...</span><br><span class="line">➜  src clang++-15 -Xclang -fdump-vtable-layouts test.cpp</span><br><span class="line">Vtable for &#x27;A&#x27; (3 entries).</span><br><span class="line">   0 | offset_to_top (0)</span><br><span class="line">   1 | A RTTI</span><br><span class="line">       -- (A, 0) vtable address --</span><br><span class="line">   2 | void A::func()</span><br><span class="line"></span><br><span class="line">VTable indices for &#x27;A&#x27; (1 entries).</span><br><span class="line">   0 | void A::func()</span><br></pre></td></tr></table></figure>

<p>x86-64 msvc 19.25.28614 输出结果</p>
<figure class="highlight txt"><table><tr><td class="code"><pre><span class="line">(base) PS D:\Code\Cpp\learn-git&gt; cl /d1 reportAllClassLayout test.cpp</span><br><span class="line">...</span><br><span class="line">class A size(16):</span><br><span class="line">        +---</span><br><span class="line"> 0      | &#123;vfptr&#125;</span><br><span class="line"> 8      | n</span><br><span class="line">        | &lt;alignment member&gt; (size=4)</span><br><span class="line">        +---</span><br><span class="line"></span><br><span class="line">A::$vftable@:</span><br><span class="line">        | &amp;A_meta</span><br><span class="line">        |  0</span><br><span class="line"> 0      | &amp;A::func</span><br><span class="line"></span><br><span class="line">A::func this adjustor: 0</span><br></pre></td></tr></table></figure>

<p>从图中我们可以看出，三个编译器给出的虚表结构以及内存布局基本一致，且虚指针就位于类的前8字节，可以使用
<code>reinterpret_cast</code>
来读取，而虚表本质上是一个指针数组。我们可以尝试直接从虚表中拿到虚函数的真实地址进行调用。代码如下</p>
